#Даниил

# Список из 5 книг, каждая книга - словарь с ключами title, author, year
books = [
    {"title": "Гарри Поттер и философский камень", "author": "Дж. К. Роулинг", "year": 1997},
    {"title": "Гарри Поттер и Тайная комната", "author": "Дж. К. Роулинг", "year":1998},
    {"title": "Гарри Поттер и узник Азкабана", "author": "Дж. К. Роулинг", "year":1999},
    {"title": "Гарри Поттер и Кубок огня", "author": "Дж. К. Роулинг", "year":2000},
    {"title": "Гарри Поттер и Орден Феникса", "author": "Дж. К. Роулинг", "year":2003}
]

# Перебираем все книги в списке, i - номер книги (начинаем с 1)
for i, book in enumerate(books, 1):
    # Верхняя строка с номером книги
    print("-" * 23 + f" Книга {i} " + "-" * 23)
    # Информация о названии и авторе
    print(f" Название: {book['title']}, Автор: {book['author']},")
    # Нижняя строка с годом издания
    print(" " + "-" * 25 + str(book['year']).center(3) + "-" * 25)
    # Пустая строка для разделения
    print()